BaseConfiguration/Money_2_0/InformationRegisters/ЗначенияНастроекИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияНастроекИнтеграции</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеНастройки</Name>
					<Comment>Только для хранения "сложных типов" и строк длиннее 250-и символов</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BaseConfiguration/Money_2_0/InformationRegisters/ЗначенияНастроекИнтеграции/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Список_настроек

// Имена настроек, используемые в регистре
// "Сервер менеджера сервиса" - URL сервера для регистрации абонента
// "Сервис промо-регистрации" - путь к сервису на сервере
// "Сервис быстрой регистрации" - путь к сервису на сервере
// "Сервис внешнего интерфейса" - 
// "Сервис биллинга приложения" - 
// "Код приложения на сервере" - 
// "Код сайта промо-регистрации" - 
// "" - 
// "" - 
// "" - 
// "" - 

	
#КонецОбласти 	
	
	

#Область ПрограммныйИнтерфейс

// Возвращает значение настройки с указанными именем. Если настройки нет, возвращает ЗначениеПриОстуствииНастройки
//
//Параметры:
//	ИмяНастройки - Строка - наименование настройки
//	ЗначениеПриОстуствииНастройки - произвольный - значение, которое будет возращено при остуствии настройки
//
//Возвращаемое значение:
//	Произвольный тип - значение настройки или ЗначениеПриОстуствииНастройки, если настройки с заданным именем не сушествует.
//
Функция ЗначениеНастройки(ИмяНастройки, ЗначениеПриОстуствииНастройки = Null) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИмяНастройки",     ИмяНастройки);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Настройки.Тип КАК Тип,
	|	Настройки.ЗначениеСтрокой КАК ЗначениеСтрокой,
	|	Настройки.ЗначениеНастройки КАК ЗначениеНастройки
	|ИЗ
	|	РегистрСведений.ЗначенияНастроекИнтеграции КАК Настройки
	|ГДЕ
	|	Настройки.ИмяНастройки = &ИмяНастройки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Настройки.ИмяНастройки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат ЗначениеПриОстуствииНастройки;
	КонецЕсли;
	
	Результат = ОпределитьРезультатВыборки(Выборка);
	
	Возврат Результат;

КонецФункции

// Добавляет или изменяет настройку с указанными именем и ключем
//
//Параметры:
//	ИмяНастройки - Строка - наименование настройки
//	ЗначениеНастройки - Произвольное значение, которое нужно записать в настройку
//			если задан Null - текущее значение настройки не изменяется
//	Перезаписывать - Булево - Нужно ли перезаписывать существующие значения новыми
//
Процедура ЗаписатьНастройку(ИмяНастройки, ЗначениеНастройки = Null, Перезаписывать = Истина) Экспорт
	
	Запись = РегистрыСведений.ЗначенияНастроекИнтеграции.СоздатьМенеджерЗаписи();
	Запись.ИмяНастройки     = ИмяНастройки;
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		Запись.ИмяНастройки     = ИмяНастройки;
	ИначеЕсли Не Перезаписывать Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеНастройки <> Null Тогда
		
		ТипНастройки = ТипЗнч(ЗначениеНастройки);
		Если ТипНастройки = Тип("Строка") Тогда
			Запись.Тип             = "Строка";
			Запись.ЗначениеСтрокой = ЗначениеНастройки;
			Если СтрДлина(ЗначениеНастройки) > 250 Тогда
				Запись.ЗначениеНастройки = Новый ХранилищеЗначения(ЗначениеНастройки);
			КонецЕсли;
		ИначеЕсли ТипНастройки = Тип("Число") Тогда
			Запись.Тип             = "Число";
			Запись.ЗначениеСтрокой = Формат(ЗначениеНастройки, "ЧГ=") ;
		ИначеЕсли ТипНастройки = Тип("Дата") Тогда
			Запись.Тип             = "Дата";
			Запись.ЗначениеСтрокой = Формат(ЗначениеНастройки, "ДФ=ггггММддЧЧммсс") ;
		ИначеЕсли ТипНастройки = Тип("Булево") Тогда
			Запись.Тип             = "Булево";
			Запись.ЗначениеСтрокой = Формат(ЗначениеНастройки, "БЛ=Ложь; БИ=Истина") ;
		ИначеЕсли ТипНастройки = Тип("Неопределено") Тогда
			Запись.Тип             = "Неопределено";
		Иначе
			Запись.ЗначениеНастройки = Новый ХранилищеЗначения(ЗначениеНастройки);
		КонецЕсли;
		
	КонецЕсли;
	
	Запись.Записать(Истина);
	
КонецПроцедуры

// Добавляет или изменяет список настроек
//
//Параметры:
//	СписокНастроек - массив или иная коллекция, каждый элемент которой содержит одноименные регистру поля
//
Процедура ЗаписатьСписокНастроек(СписокНастроек) Экспорт
	
	Для каждого ЭлементСписка Из СписокНастроек Цикл
		ЗаписатьНастройку(ЭлементСписка.ИмяНастройки, ЭлементСписка.ЗначениеНастройки);
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытий


#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Заполняет настройки интеграции значениями по умолчанию
//
Процедура ЗаполнитьЗначениямиПоУмолчанию(Перезаписывать = Ложь) Экспорт
	
	ЗаписатьНастройку(ДеньгиВОблакеКлиентСервер.ИмяНастройкиСерверМС(),       АдресСервераМС(), Перезаписывать);
	ЗаписатьНастройку(ДеньгиВОблакеКлиентСервер.ИмяНастройкиСервисБыстройРегистрации(),     "a/extreg/hs/ExternalRegistration/", Перезаписывать);
	ЗаписатьНастройку(ДеньгиВОблакеКлиентСервер.ИмяНастройкиСервисВнешнегоИнтрефейса(),     "a/adm/hs/ext_api/", Перезаписывать);
	ЗаписатьНастройку(ДеньгиВОблакеКлиентСервер.ИмяНастройкиСервисБиллинга(),     "hs/moneybill/", Перезаписывать);
	ЗаписатьНастройку(ДеньгиВОблакеКлиентСервер.ИмяНастройкиКодПриложения(),      "money", Перезаписывать);
	ЗаписатьНастройку(ДеньгиВОблакеКлиентСервер.ИмяНастройкиКодПромоРегистрации(),    "695", Перезаписывать);
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Приводит результат из полей выборки к указанному в ней типу значения настройки
Функция ОпределитьРезультатВыборки(Выборка)

	Результат = Неопределено;
	РезультатИзХранилища = Выборка.ЗначениеНастройки.Получить();
	Если Выборка.Тип = "Неопределено" Тогда
		Результат = Неопределено;
	ИначеЕсли Выборка.Тип = "Строка" Тогда
		Результат = ?(РезультатИзХранилища = Неопределено, Выборка.ЗначениеСтрокой, РезультатИзХранилища);
	ИначеЕсли Выборка.Тип = "Число" Тогда
		Результат = ?(СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Выборка.ЗначениеСтрокой), Число(Выборка.ЗначениеСтрокой), 0);
	ИначеЕсли Выборка.Тип = "Дата" Тогда
		Результат = ?(СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Выборка.ЗначениеСтрокой), Дата(Выборка.ЗначениеСтрокой), Дата(1,1,1));
	ИначеЕсли Выборка.Тип = "Булево" Тогда
		Результат = ?(НРег(СтроковыеФункцииКлиентСервер.ЗначениеСтрокой) = "истина" Или НРег(СтроковыеФункцииКлиентСервер.ЗначениеСтрокой) = "true", Истина, Ложь);
	Иначе
		Результат = РезультатИзХранилища;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция АдресСервераМС()

	Если ДеньгиВОблаке.ИспользуютсяПодсистемыОблака() Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОСДСервер");
		Если Модуль <> Неопределено Тогда
			Возврат Модуль.СерверМенеджераСервиса();
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДеньгиВОблакеКлиентСервер.АдресСервераМС();

КонецФункции
 
#КонецОбласти


#КонецЕсли
